Repository: mehr4n/Bdtunnel
Catalog: BdtClient/Resources/Strings.*.resx
Languages: fr

# CLIENT_STARTED
source: Client started, press enter key to exit...
fr: Client demarre, appuyez sur entree pour quitter...

# CONNECTION_FAILED
source: Unable to connect to server (check proxy settings)
fr: Impossible de se connecter au serveur (verifiez les reglages du proxy)

# FORWARD_CANCELED
source: Port {0} already in use, disabling forward to {1}:{2}
fr: Le port {0} est deja occupe, forward vers {1}:{2} annule

# FORWARDING
source: Forwarding {0}:{1} to {2}:{3}
fr: Forward de {0}:{1} vers {2}:{3}

# INPUT_PROXY_DOMAIN
source: Enter domain:
fr: Entrez le domaine:

# INPUT_PROXY_PASSWORD
source: Enter password (hidden):
fr: Entrez le mot de passe (masque):

# INPUT_PROXY_USERNAME
source: Enter username:
fr: Entrez l'utilisateur:

# INVALID_PORT
source: Port number must be set between {0} and {1}
fr: Le port doit être compris entre {0} et {1}

# INVALID_SOCKS_HANDSHAKE
source: Invalid handshake with socks handler
fr: Echange incorrect avec le gestionnaire Socks

# NO_VALID_SOCKS_HANDLER
source: No valid socks handler found
fr: Aucun gestionnaire Socks adapte pour la requete

# NOT_USING_PROXY
source: Direct connexion without proxy
fr: Connexion directe sans proxy

# PROXY_AUTH_REQUESTED
source: Proxy authentication requested
fr: Une authentification sur le proxy est necessaire

# SOCKS_BIND_UNSUPPORTED
source: Socks bind request unsupported
fr: Requete Socks BIND non supportee

# SOCKS_SERVER_DISABLED
source: Port {0} already in use, disabling Socks server
fr: Le port {0} est deja occupe, serveur Socks desactive

# SOCKS_SERVER_STARTED
source: Socks server listening to {0}:{1}
fr: Serveur Socks à l'ecoute {0}:{1}

source: Socks4 request handled
fr: Requete Socks4 supportee

source: Socks4A request handled
fr: Requete Socks4A supportee

# SOCKS5_ADDRESS_TYPE_UNKNOWN
source: Unknown address type in Socks5 request
fr: Requete Socks5: type d'adresse inconnu

# SOCKS5_BAD_VERSION
source: Bad Socks5 version
fr: Version Socks5 erronee

# SOCKS5_IPV6_UNSUPPORTED
source: Unsupported IPV6 addresses in Socks5 request
fr: Adresses Socks5 IPV6 non supportees

# SOCKS5_MALFORMED_METHOD_ENUM
source: Malformed method enumeration in Socks5 request
fr: Enumeration de methode Socks5 malformee

# SOCKS5_NO_AUTHENTICATION_SUPPORTED
source: No Socks5 authentication supported
fr: Aucune authentification Socks5 n'est supportee

source: Socks5 request handled
fr: Requete Socks5 supportee

# SOCKS5_UDP_UNSUPPORTED
source: UDP unsupported in Socks5 request
fr: Requete Socks5: UDP non supportee

# SOCKS5_UNKNOWN_COMMAND
source: Unknown command in Socks5 request
fr: Requete Socks5: commande inconnue

# USING_PROXY
source: Using proxy: {0}
fr: Connexion avec un proxy: {0}

# VERSION_MISMATCH
source: Version mismatch between client and server
fr: les versions du client et du serveur ne sont pas identiques
